SOAP.postman_collection.json

{
	"info": {
		"_postman_id": "39250281-e332-4fdd-a6df-962d2910800c",
		"name": "SOAP",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json"
	},
	"item": [
		{
			"name": "New Request",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <CapitalCity xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n            <sCountryISOCode>BY</sCountryISOCode>\r\n        </CapitalCity>\r\n    </Body>\r\n</Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		}
	]
}